import streamlit as st

"""
# Общая информация
 **Matplotlib** - библиотека языка программирования Python для создания статических и интерактивных визуализаций данных в виде двумерных и трёхмерных графиков.\n 
Возможности Matplotlib:
1. Построение двумерных графиков практически всех нужных типов:  линейные графики, столбчатые диаграммы, точечные графики, круговые диаграммы
2. Поддержка основных типы трёхмерных графиков
3. Настройка визуального стиля: цвета, метки, подписи, шрифты и др.
4. Создавание интерактивные графики, которые можно масштабировать, перемещать и добавлять всплывающие окна
5. Экспорт во многие форматы файлов: PNG, JPEG, PDF
6. Интеграция С NumPy: Matplotlib легко интегрируется с библиотекой NumPy, что делает его мощным инструментом для визуализации данных, представленных в виде массивов NumPy.
"""

